// 1.1. რა მონაცემთა ტიპები ვიცით JavaScript-ში? (Primitive vs Non-Primitive)
// primitives: string, number, boolean, null, undefined, symbol, bigint
// Non-Primitives: object, array, function

// 1.2. რა განსხვავებაა ცვლადის გამოცხადების ტიპებს შორის: var, let და const?
// სამივე გამოიყენება ცვლადის დეკლარაციისთვის. const გამოიყენება კონსტანტებისთვის, რომლის მნიშვნელობაც არ იცვლება. let გამოიყენება ცვლადებისთვის, რომელთა მნიშვნელობა შეიძლება შეიცვალოს. var არის ძველი ტიპის ცვლადი, რომელიც ფუნქციის მასშტაბშია და აქვს ჰოისტინგი (hoisting) თვისება, რაც ნიშნავს, რომ ის შეიძლება გამოყენებულ იქნას დეკლარაციამდე.

// 1.3. განმარტეთ Call Stack და Memory Heap: რა განსხვავებაა მათ შორის და სად ინახება მონაცემები?
// Call Stack არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება ფუნქციების გამოძახებისას. Call Stack მუშაობს LIFO (Last In, First Out) პრინციპით.
// Memory Heap ესეც არის მონაცემთა სტრუქტურა, რომელშიც ინახება ობიექტები და მათი მნიშვნელობები.

// 1.4. რა არის Event Loop (მოვლენათა ციკლი) Node.js-ში და როგორ მუშაობს ის?
// event loop არის მექანიზმი, რომელიც ასინქრონული ოპერაციების შესრულებისთვის გამოიყენება. ის მუშაობს შემდეგნაირად: 
// კოდი თავდაპირველად ხვდება Call Stack-ში. ასინქრონული ოპერაციები, მაგალითად setTimeout-ი ან HTTP მოთხოვნები, გადაეცემა Node.js-ის შესაბამის API-ს. ოპერაციის დასრულების შემდეგ მისი callback ხვდება Queue-ში (გვაქვს Microtask და Macrotask queues). Event Loop ამოწმებს Call Stack-ს და თუ ის თავისუფალია, Queue-დან callback-ს იღებს და Call Stack-ში გადასცემს შესასრულებლად (უპირატესობა ენიჭება Microtask-ებს).

// 1.5. რა არის Promise? აღწერეთ მისი მდგომარეობები (States) და რით განსხვავდება ის Callback-ებისგან?
// Promise არის ობიექტი, რომელიც არის ასინქრონული ოპერაციის შედეგი. Promise-ს აქვს სამი სთეითი: fulfilled, rejected და pending. 
// Callback არის ფუნქცია, რომელიც სხვა ფუნქციას გადაეცემა პარამეტრად, ხოლო Promise ობიექტია. Promise საშუალებას გვაძლევს ასინქრონული კოდი უფრო სტრუქტურირებულად ვმართოთ .then(), .catch() და async/await-ის გამოყენებით.

// 1.6. რა არის Async/Await და როგორ მუშაობს ის Promise-ების ბაზაზე?
// async/await არის Promise-ებთან მუშაობის სინტაქსი. async ფუნქცია ყოველთვის აბრუნებს Promise-ს, ხოლო await გამოიყენება Promise-ის შედეგის დასალოდინებლად. await არ აჩერებს მთლიან პროგრამას, მხოლოდ კონკრეტული async ფუნქციის შესრულებას აჩერებს Promise-ის დასრულებამდე.

// 1.7. რა არის Class (კლასი) JavaScript-ში და რა არის OOP-ის (ობიექტზე ორიენტირებული პროგრამირების) ძირითადი პრინციპები?
// კლასი არის შაბლონი, რომლის მიხედვითაც იქმნება ობიექტი. OOP-ის ძირითადი პრინციპებია: მემკვიდრეობა, ინკაფსულაცია, პოლიმორფიზმი და აბსტრაქცია.

// 1.8 რამდენი აგრემო იცით. და მათი განსხვავბეა ?
// Node-ისა და Browser-ის გარემოები. Browser-ში JavaScript ძირითადად ვებ-გვერდთან და DOM-თან მუშაობს, ხოლო Node.js-ში შეგვიძლია JavaScript გამოვიყენოთ სერვერის, ფაილებისა და ქსელური ოპერაციებისათვის.


// 2.1. რა არის Request-Response?
// Request არის მოთხოვნა რომელსაც კლიენტი უგზავნის სერვერს, ხოლო რესფონსი არის პასუხი რომელიც იგზავნება სერვერის მიერ კლიენტთან.

// 2.2.ჩამოთვალე რექვესთები და მათი თავისებურება განმარტე.
// GET - მონაცემების მიღება
// POST - ახალი მონაცემის შექმნა
// PUT - არსებული რესურსის სრულად განახლება
// PATCH - არსებული რესურსის ნაწილობრივ განახლება
// DELETE - მონაცემის წაშლა

// 2.3. რა განსხვავებაა URL Params-ს, Query Params-სა და Request Body-ს შორის? (როდის რომელს ვიყენებთ?)
// URL Params გამოიყენება კონკრეტული რესურსის იდენტიპიცირებისთვის, მაგალითად /users/:id. Query Params გამოიყენება დამატებითი პარამეტრების გადასაცემად URL-ში, მაგალითად /users?age=30. Request Body გამოიყენება POST ან PUT მოთხოვნებში მონაცემების გადასაცემად

// 2.4. რა არის Middleware Express.js-ში/NestJS-ში და რაში გამოიყენება ის?
// Middleware არის ფუნქცია რომელიც რექვესთსა და რესფონსს შორის მუშაობს. ის გამოიყენება იმისათვის რომ შეამოწმოს რექვესთი.



// 3.1. რა არის შრეობრივი არქიტექტურა (Layered Architecture) და რა პასუხისმგებლობები აქვთ:
// Layered Architecture არის აპლიკაციის სტრუქტურა, სადაც კოდი დაყოფილია სხვადასხვა შრედ და თითოეულ შრეს თავისი პასუხისმგებლობა აქვს
//      - Controller - (იგივე როუტერი) პასუხისმგებელია რექვესთების მიღებაზე, ენდფოინთების განსაზღვრაზე და რესპონსის დაბრუნებაზე.
//      - Service - სერვისში განსაზღვრულია ლოგიკა
//      - module - მოდული არის აპლიკაციის ლოგიკური ერთეული, რომელიც აერთიანებს როუტერებს, სერვისებს და სხვა კომპონენტებს.

// 3.3. რა არის Dependency Injection (DI) ?
// Dependency Injection არის დიზაინის პრინციპი, რომლის დროსაც კლასს საჭირო dependency-ს თავად შექმნის ნაცვლად, ის გარედან მიეწოდება

// 3.4. რა არის DTO (Data Transfer Object) და რატომ ვიყენებთ მას Validation Pipe-ებთან ერთად?
// DTO არის ობიექტი სადაც განსაზღვრულია ის ველები, რომელიც უნდა მივიღოთ რექვესთიდან. Validation Pipe გვიადვილებს ამ ველების ტიპების შემოწმებას და ვალიდაციას