// / 1)რა განსხვავებაა let, const შორის?
// let და const, ორივე გამოიყენება ცვლადების დეკლარაციისთვის, ორივე არის block scoped,
// const-ით განსაზღვრული ცვლადის რეინიციალიზაცია არ შეგვიძლია,
// ხოლო let-ით განსაზღვრული ცვლადის შეცვლა შესაძლებელია.
// ასევე აუცილებელია ცვლადის ინიციალიზაცია დეკლარაციისთანავე const-ის შემთხვევაში.

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
// primitive ტიპები მნიშვნელობით ინახებიან და ცვლადის კოპირებისას მნიშვნელობა კოპირდება. 
// nonprimitive იგივე reference ტიპები მეხსიერებაში მიმთითებლების გამოყენებით ინახებიან. ცვლადის კოპირებისას თავად ობიექტი კი არა, მისი მისამართი კოპირდება. ასეთი ტიპებია: ობიექტები, მასივი, ფუნქცია, კლასი 

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
// სამი ტოლობა ტიპიზირებული ტოლობაა რაც გულისხმობს იმას რომ ის ადარებს არა მხოლოდ მნიშვნელობებს არამედ მათ ტიპებაც. მაგალითად "3"=== 3 დაგვიბრუნებს false-ს
// ორი ტოლობა კი ადარებს მხოლოდ მნიშვნელობებს 

// 4)რა ტიპის არის null
// null არის ობიექტის ტიპი. ეს არის ჯავასქრიპტის ბაგი, რომელსაც შეგნებულად არ ასწორებენ. 
// თავდაპირველად ცვლადები მეხსიერებაში ინახებოდა 32 ბიტიან სტრინგებად სადაც პირველი სამი ბიტი ეთმობოდა თაგს, რომელიც განსაზღვრავდა ამ ცვლადის ტიპს. ვინაიდაან და რადგანაც null მეხსიერებაში იწერებოდა როგორც 0-ების მიმდევრობა პირველი სამი ბიტი გამოდიოდა: 000, რაც მიუთითებდა ობიექტზე 

// 5)რა განსხვავებაა funtion და = () => {} შორის
// ორივე გამოიყენება ფუნქციის ინიციალიზაციისთვის, თუმცა ერეი ფუნქციის გამოძახება დეკლარაციამდე არ შეგვიძლილა.

// 6)რას ნიშნავს callback function?
// Callback Function არის ფუნქცია, რომელსაც არგუმენტად გადავცემთ სხვა ფუნქციას და რომელიც მოგვიანებით გამოიძახება.

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
// სამივე არის ჯავასკრიპტში ჩაშენებული high order, ჰელფერ ფუნქცია, თუმცა გააჩნიათ სცვადასხვა მნიშვნელობები:
// map - გადაუვლის მასივს და მის თითოეულ ელემენტზე ჩაატარებს გარკვეულ მანიპულაციას და დააბრუნებს ახალ მასივს
// filter - გადავცემთ გარკვეულ ქონდიშენს და რომელი ელემენტებიც აკმაყოფილებენ ამ პირობას მხოლოდ იმ ელემენტებით შექმნილ ახალ მასივს დააბრუნებს
// reduce - ეს ფუნქცია იღებს accumelator-ს და current მნიშვნელობებს და ფუნქციას ერთ კონკრეტულ მნიშვნელობამდე "ამცირებს", მისი გამოყენება შეგვიძლია ისეთი ამოცანების ამოხსნისას სადაც დაჯგუფება გვჭირდება

// 8)რა არის Promise?
// Promise არის ობიექტი, რომელიც წარმოადგენს ასინქრონული ოპერაციის მომავალ შედეგს. მას აქვს სამი მდგომარეობა: Pending, Fulfilled და Rejected

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// Promise.all-ს ვაწვდით ფრომისების მასივს და ის გვიბრუნებს თითოეული ფრომისის რეზოლვის შედეგს და თუ რომელიმე ფრომისი დარეჯექთდება მთლიანი პრომისი რეჯექთდება
// Promise.race-ი აბრუნებს იმ Promise-ის შედეგს, რომელიც პირველი დასრულდება, მნიშვნელობა არ აქვს resolve იქნება თუ reject.
// Promise.any აბრუნებს პირველ წარმატებულ პრომისს გადაცემულ პრომისების მასივიდნ, ხოლო თუ ყველა პრომისი დარეჯექთდება დააბრუნებს AggregateError-ს.

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
// async/await არის პრომისებთან მუშაობის თანამედროვე სინტაქსი. async ფუნქციას ასინქრონულად აქცევს და პრომისს აბრუნებს, 
// ხოლო await-ით შესაძლებელია ფუნქციის დაპაუზება მანამ სანამ პრომისი არ დასრულდება.

// 11)რა განსხვავებაა class-სა და object-ს შორის?
// ობიექტი არის კლასის ინსტენსი, ხოლო კლასი არის ბლუპრინტი, შაბლონი ობიექტის

// 12)რას აკეთებს constructor class-ში?
// კონსტრუქტორის საშუალებითაც ხდება საწყისი მნიშვნელობების ინიციალიზაცია და ის კლასის ინსტანსის შექმინსას ავტომატურად გამოიძახება.

//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
// მემორი სტეკში ინახება პრიმიტიული ტიპები და არაპრიმიტიული ტიპების მისამართები, ხოლო მემორი ჰიპში რეფერენს ტიპების რეალური მონაცემები

//14) რა არის ქოლსტეკი
// ქოლსტეკი არის მონაცემთა სტრუქტურა რომელიც აკონტროლებს ფუნქციების გამოძახებასა და შესრულებას. ის მუშაობს LIFO პრინციპით ბოლო გამოძახებული ფუნქცია პირველი სრულდება და სტეკიდან იშლება.

//15) რა არის ივენთ ლუპი
// Event Loop არის JavaScript-ის მექანიზმი, რომელიც მუდმივად ამოწმებს Call Stack-ს. როცა Call Stack ცარიელია, ის Queue-ებიდან ჯერ Microtask Queue, შემდეგ Macrotask Queue იღებს callback-ებს და აგზავნის Call Stack-ში შესასრულებლად. სწორედ Event Loop აძლევს JavaScript-ს ასინქრონული ოპერაციების მართვის შესაძლებლობას.

